name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "tests/lenet_train/mnist_train_lmdb"
    backend: LMDB
    batch_size: 64
  }
  transform_param {
    scale: 0.00390625
  }
  include: { phase: TRAIN }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "tests/lenet_train/mnist_test_lmdb"
    backend: LMDB
    batch_size: 64
  }
  transform_param {
    scale: 0.00390625
  }
  include: { phase: TEST }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  gpu_0_batch_proportion: 0.20
  gpu_1_batch_proportion: 0.20
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.25
  convolution_param {
    group: 2
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  gpu_0_batch_proportion: 0.20
  gpu_1_batch_proportion: 0.20
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.25
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  gpu_0_batch_proportion: 0.20
  gpu_1_batch_proportion: 0.20
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.25
  convolution_param {
    group: 2
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  gpu_0_batch_proportion: 0.20
  gpu_1_batch_proportion: 0.20
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.20
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool2"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  gpu_0_batch_proportion: 0.20
  gpu_1_batch_proportion: 0.20
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.20
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  gpu_0_batch_proportion: 0.26
  gpu_1_batch_proportion: 0.28
  gpu_2_batch_proportion: 0.20
  gpu_3_batch_proportion: 0.20
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "drop1"
  type: "Dropout"
  bottom: "ip1"
  top: "ip1"
  dropout_param {
    dropout_ratio: 0.5
  }
  gpu_0_batch_proportion: 0.25
  gpu_1_batch_proportion: 0.25
  gpu_2_batch_proportion: 0.25
  gpu_3_batch_proportion: 0.25
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  gpu_0_batch_proportion: 0.25
  gpu_1_batch_proportion: 0.25
  gpu_2_batch_proportion: 0.25
  gpu_3_batch_proportion: 0.25
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
